[
	{
		"advertID": 1,
		"advertName": "35 Windsor Road, Rathmines, Dublin 6, South Dublin City",
		"advertDescription" : "A very fine Victorian residence, presented in pristine decorative order throughout having been recently refurbished and upgraded, retaining period features and boasting a large open plan kitchen/breakfast/dining room extension to the rear. This most impressive family home provides generous and well proportioned accommodation extending to approximately 191sqm (2,055sqft). Built circa 1870, No. 35 boasts elegantly proportioned accommodation, with many period features including ornate marble fireplace, ornate ceiling coving and cornice work, high ceilings, and sash windows. The accommodation includes a welcoming reception hall with oak flooring and fan light over the front door, the drawing room/living room to the front boasts an attractive white marble fireplace with coal effect gas fire, sash window overlooking the front garden, ceiling coving, and ornate centre rose. There are steps down to an inner hall, off which there is a downstairs w.c., and a family room with modern gas fire, fitted shelving either side, and arch through to a large kitchen/breakfast/dining room extension, which is exceptionally well fitted with a Neptune kitchen with excellent storage space, centre island unit, and bi-folding doors opening out to the rear garden.",
		"featuredImage" : "./pictures/windsorroad.jpg",
		"additionalMedia" : [
			"./pictures/windsorroad2.jpg",
			"./pictures/windsorroad3.jpg"
		],
		"RoomDetails": "4 Bed , 1 Bath",
		"NumberRating": "B4 Energy Rating",
		"price": "£1,320,000.00"
	},
	{
		"advertID": 2,
		"advertName": "Fernhill Park, Manor Estate, Terenure, Dublin",
		"advertDescription" : "We are pleased to bring this lovely bright spacious family home, in need of some modernisation to the sales market. Situated in the mature, quiet residential area of Fernhill Park, Terenure, and close to all amenities including churches, schools, shops, M50 network and public transport. The home comprises of entrance porch with patio style sliding door, a large hallway leading into a lovely spacious living room with a fitted fireplace and then into a large bright Dining room, overlooking the large rear garden and then the fully fitted kitchen and understair storage. Finally ground floor boasts a utility/shed/storage room just outside the kitchens exterior door. First floor comprises of two large bright double bedrooms, and one spacious single bedroom, and finally the family bathroom.",
		"featuredImage" : "./pictures/Fernhillpark.jpg",
		"additionalMedia" : [
			"./pictures/Fernhillpark2.jpg",
			"./pictures/Fernhillpark.jpg"
		],
		"RoomDetails": "3 Bed , 1 Bath",
		"NumberRating": "B4 Energy Rating",
		"price": "£300,000.00"
	},
	{
		"advertID": 3,
		"advertName": "No.2, 33 Mountjoy Square, (With Mezzanine Level), Dublin 1, Dublin",
		"advertDescription" : "This is a truly stunning property which incompasses period charm with modern day living. This spacious home has an ideal central location in Dublin city overlooking Mountjoy Square and comes to the market in turnkey condition offering numerous Georgian-era features consistant with neighbouring period buildings. No 2, 33 Mountjoy Square offers private front door entrance, high ceilings and has benefitted from the welcome addition of a mezzanine level which adds two further rooms, second bathroom and a contemporary mezzanine area ideal as an office or additional living space. Upon entering through the beautiful georgian feature doorway you are met with an abundance of natural light from the period arched fanlight and side panel windows, and the contempary interior creates an instant impression.The grandure style of the living room is enhanced by high ceiling, rose centre piece, detailed coving, large period style windows and seamlessly leads onto the kitchen and dining area. There is also and additional dining or family room . The owners currently use four rooms as bedrooms and there are two contempary bathrooms.Outside there is secure parking facility and there is a communal courtyard at the back of the building where bikes can be stored. The management company for the building is well established and has a healthy sinking fund in place.Mountjoy Square is a highly sought after city centre location and is only minutes from O'Connell Street, Parnell LUAS stop (red line) Connolly Station (LUAS, DART and rail services) all within a short walk. Croke Park Stadium is within a 3-minute walk, with the Mater, Rotunda and Temple Street Hospitals all nearby. There is an abundance of city centre bars, shops and schools nearby. Access is through red door at corner of Mountjoy Square and Charles Street Great.Viewing is strictly by appointment with DNG agents 018300989, and comes very highly recommended to appreciate this unique property, which would suit an owner occupier or a buy to let investor seeking a strong rental yield,",
		"featuredImage" : "./pictures/mountjoysq.jpg",
		"additionalMedia" : [
			"./pictures/mountjoysq2.jpg",
			"./pictures/mountjoysq3.jpg"
		],
		"RoomDetails": "4 Bed , 2 Bath",
		"NumberRating": "A2 Energy Rating",
		"price": "£350,000.00"
	},
	{
		"advertID": 4,
		"advertName": "partment 33, Bracken Hill, Simon's Ridge, Dublin 18, Sandyford",
		"advertDescription" : "One of The Beacon’s brightest interior designed luxury two bedroom apartments with balcony overlooking a quiet private courtyard is to be found in this modern upmarket apartment complex set in south Dublin’s prime business location adjacent to the Beacon Hotel and Hospital and which is finished to an exacting standard throughout and benefits from designated underground car parking and a private sun balcony with south westerly facing aspect. The property has been particularly well maintained throughout to give a modern walk in interior designed property with no extra work or additional outlay requirement. This apartment features a high gloss kitchen, luxuriously appointed marble bathroom, mood lighting, high ceilings and distinctive communal areas are further complemented as these upmarket apartment suites are connected to the Beacon Hotel and its services are available to the One Beacon Residents",
		"featuredImage" : "./pictures/brackenhill.jpg",
		"additionalMedia" : [
			"./pictures/brackenhill2.jpg",
			"./pictures/brackenhill3.jpg"
		],
		"RoomDetails": "2 Bed , 1 Bath",
		"NumberRating": "A2 Energy Rating",
		"price": "£280,000.00"
	},
	{
		"advertID": 5,
		"advertName": "Highfield Lawns, Swords, Co Dublin K67 Y362",
		"advertDescription" : "We are delighted to bring to the market No. 36 Highfield Lawns in Swords. This excellent red brick detached house is located in a quiet cul de sac in this most sought after area in Swords. Maintained to a very high standard by its current owners, any discerning buyer will just have to turn the key and move their furniture in. Among many special features include a large sitting room with double folding doors, opening into light filled areas incorporating a modern high gloss fitted kitchen and dining area with sold oak flooring throughout. Upstairs there are 4 bedrooms and a family bathroom, the master bedroom with en suite. From the Highfields development, you can literally stroll around the corner and be in the centre of Swords Village and right beside the Pavillions Shopping Centre. The public transport links in Swords Village is excellent and of course, there are numerous schools, shops, restaurants and bars practically on the doorstep. For anyone looking to trade up in Swords or even considering purchasing for the first time, this is an excellent house in an excellent location. Viewing is very highly recommended.",
		"featuredImage" : "./pictures/highfieldlawns.jpg",
		"additionalMedia" : [
			"./pictures/highfieldlawns2.jpg",
			"./pictures/highfieldlawns3.jpg"
		],
		"RoomDetails": "4 Bed , 1 Bath",
		"NumberRating": "A1 Energy Rating",
		"price": "£700,000.00"
	},
	{
		"advertID": 6,
		"advertName": "5 Dartry Park, Dartry, Dublin 6, D06 K526",
		"advertDescription" : "A  most elegant Thompson built family home extending to 213sqm/2,292sqft. Superbly positioned right in the heart of Dartry, tucked away in this quiet cul de sac just off Dartry Road. The location is both quiet and central with local shops as well as the villages of Rathmines and Rathgar close by. Ranelagh is only 2 stops on the Luas from Milltown, which is only approx. 6 minute walk away. Lived in for almost sixty years by the same family, both house and gardens have been lovingly maintained and await a new generation to continue the tradition and create a wonderful family home. Rooms of elegant proportions are enhanced by original period features, where superb interconnecting reception rooms provide flow throughout downstairs and out to the garden. The kitchen/breakfast area offers wonderful potential to open up the back of the house. Upstairs, four generous bedrooms and a family bathroom complete the accommodation. The rear garden is a real bonus; south facing, private and superbly landscaped with a large lawn and large raised deck area, perfect for outdoor entertaining. This large garden coupled with the large garage also provides further scope to extend this, already, generous home. The front garden is also landscaped and provides off street parking for several cars. Few locations offer more in terms of convenience with Dartry, Rathgar, Rathmines and Ranelagh on its doorstep.",
		"featuredImage" : "./pictures/dartypark.jpg",
		"additionalMedia" : [
			"./pictures/dartypark2.jpg",
			"./pictures/dartypark3.jpg"
		],
		"RoomDetails": "3 Bed , 1 Bath",
		"NumberRating": "B3 Energy Rating",
		"price": "£440,000.00"
	},
	{
		"advertID": 7,
		"advertName": "Marianella Development, Orwell Road, Rathgar, Dublin 6",
		"advertDescription" : "A luxurious lifestyle awaits you in the heart of RathgarMarianella is an exceptionally finished development of houses and apartments set amongst beautifully landscaped spacious grounds that incorporate mature 100-year-old trees. Comprising large two- and three-bedroom apartments and penthouses and large three and five-bedroom houses, Marianella homes are perfectly designed to make the most of the leafy surroundings, and are enhanced by a host of onsite amenities including an exclusive wellness suite and gym and a private cinema room. Situated in the highly sought after Victorian suburb of Rathgar, Marianella is surrounded by excellent restaurants, cafés and leisure facilities. Its close proximity to Dublin City Centre makes Marianella the perfect option for those who love the hustle and bustle of glamorous city life, but like to have a calm oasis only a few kilometres away. This is a rare opportunity to purchase something special in an exclusive and architecturally important part of Dublin.Why buy at Marianella?Carefully designed homes with top-of-the-range fixtures and fittings for easy modern livingMature landscaped park featuring 100-year-old evergreen and broadleaf trees and careful planting for year-round beautyDedicated concierge serviceResidents' clubhouse encompassing a gym, meeting rooms, a function room, and a cinema roomBasement car park with 303 spaces for residentsExcellent energy-efficient features including high levels of insulation, leading air sealing products and high-performance windowsJust 3km from Dublin City CentreFor more, and to register your interest, see www.marianella-rathgar.com Joint Selling Agents - Hooke & MacDonald and Knight Frank.About the DeveloperCairn PLC Marianella is brought to you by Cairn Homes plc. At Cairn, build quality is at the heart of everything they do.",
		"featuredImage" : "./pictures/marianella.jpg",
		"additionalMedia" : [
			"./pictures/marianella2.jpg",
			"./pictures/marianella3.jpg"
		],
		"RoomDetails": "2 Bed , 1 Bath",
		"NumberRating": "A1 Energy Rating",
		"price": "£795,000.00 - £1,600,000"
	},
	{
		"advertID": 8,
		"advertName": "30 Lower Dodder Road, Dublin 14, Rathfarnham, Dublin 14",
		"advertDescription" : "30 Lower Dodder Road is a stunning 3 bedroom extended end of terrace period residence with beautifully designed and modernised interiors. With an extensively landscaped south facing rear garden, gas fired central heating, off street parking and potential for attic conversion, this elegant home is sure to impress. The accommodation measures approx. 116m2 (1,248sq.ft.) and briefly comprises: entrance hall, shower room, family room, living room, kitchen/dining room, utility, three bedrooms and bathroom with gardens front and rear.The location is second to none positioned within walking distance of Terenure, Rathgar, Churchtown and Rathfarnham with every conceivable amenity on the doorstep. Public transport is well catered for with frequent bus services to the city centre and surrounding suburbs. The area has a great range of local amenities including some of Dublin’s finest schools and sporting facilities. With Bushy Park nearby there is no shortage of picturesque walks and green areas. The M50 is easily accessible and the Luas is close by offering quick and easy access to St. Stephen’s Green.",
		"featuredImage" : "./pictures/dodderroad.jpg",
		"additionalMedia" : [
			"./pictures/dodderroad2.jpg",
			"./pictures/dodderroad3.jpg"
		],
		"RoomDetails": "3 Bed , 1 Bath",
		"NumberRating": "B3 Energy Rating",
		"price": "£750,000.00"
	},
	{
		"advertID": 9,
		"advertName": "Ravensdale Park, Kimmage, Dublin 12 ",
		"advertDescription" : " This is a brand new development which will consist of 6 contemporary and A-Rated family homes. These houses are ideally located off Ravensdale Park with all necessary amenities on your doorstep. Each home has well-proportioned rooms finished to an exceptional standard with an excellent specification throughout.The 3-bed homes will range in size from approximately 147sq.m (1,582sq.ft.) to 171sq.m (1,840sq.ft) over 3 levels with some featuring large balconies at the upper floor level providing wonderful views of the Dublin Mountains. These homes are cleverly designed and integrate modern technology with the best in contemporary design maximising light and space in a functional way. Each home has well-proportioned rooms finished to an exceptional standard with an excellent specification throughout",
		"featuredImage" : "./pictures/ravendalecourt.jpg",
		"additionalMedia" : [
			"./pictures/ravendalecourt2.jpg",
			"./pictures/ravendalecourt3.jpg"
		],
		"RoomDetails": "5 Bed , 2 Bath",
		"NumberRating": "B2 Energy Rating",
		"price": "£585,000.00"
	},
	{
		"advertID": 10,
		"advertName": "5 Limekiln Manor, Limekiln Road, Walkinstown, Dublin 12",
		"advertDescription" : "Boasting many features outlined below this 4 bedrooms, 4 bathrooms comes to the market in pristine condition throughout. This property is constructed in traditional build with self coloured rendered blockwork walls and has concrete roof tiles are used on the main roof and dormer. This property comes with high quality contemporary painted finish doors throughout, complete with matching architrave, skirtings and chrome ironmongery. High performance PVC windows and patio doors are fitted with sealed triple glazing units throughout. The front door, patio doors and windows contains multi point locking system. Stylish and elegant kitchen and utility rooms are by Nolan Kitchens with modern design detailing throughout. The Quartz worktops give the kitchens a strong yet finely detailed feel. The kitchen includes both floor and eye level units with Neff Kitchen appliances fitted as standard. The electrical layout has generous allocation of light and power points located throughout the house. A high efficiency split system heat pump serving heating and hot water requirements consists of internal and external unit. The high efficiency split system Air to Water Heat Pump serves the heating & hot water requirement. There are two controlled heating zones and one hot water zone. In addition to the heating zones all radiators are fitted with thermostatic valves giving additional room by room control. Humidity sensitive mechanical extract ventilation operates based on the humidity levels. The system ensures excellent indoor air quality and can also reduce the heat losses linked with ventilation compared to a constant airflow ventilation system, in effect reducing energy needs. The Bathrooms and En-Suites have been completed with superior quality sanitary ware throughout. Chrome and glass shower doors, screens over baths and heated chrome towel rails come as standard. A booster pump provides high pressure water to the bath and showers and the cold water tank is located in the eaves storage area, the tank includes a drip tray and overflow pipe as a protection measure. The balustrade and newel posts to the timber stairs are painted and the hardwood handrail is varnished. The property has 2 private car parking spaces and a cobblelock driveway and a car charging port. The property also offer a state of the art alarm cctv system in place offering security and comfort at the highest of levels.",
		"featuredImage" : "./pictures/limekilnmanor.jpg",
		"additionalMedia" : [
			"./pictures/limekilnmanor2.jpg",
			"./pictures/limekilnmanor3.jpg"
		],
		"RoomDetails": "4 Bed , 1 Bath",
		"NumberRating": "A3 Energy Rating",
		"price": "£675,000.00"
	},
	{
		"advertID": 11,
		"advertName": "32 Willington Green, Templeogue, Dublin 6W, D6W W021",
		"advertDescription" : " A superb three-bedroom semi-detached home. Enjoying an unrivalled located in this popular and mature residential road in Dublin 6W. No. 32 would make an ideal purchase for both, first-time buyers and those looking to trade up or down. The spacious accommodation does not disappoint and certainly caters to a growing family. There is a generous living room to the front, a kitchen overlooking the garden, a dining room, downstairs WC and a small home office/ study at ground level. Upstairs, there are two double bedrooms, a single bedroom and a family bathroom. The property further benefits from a south facing rear garden with a large garage, ideal for a home office. The location alone speaks volumes about this property. Surrounded by a wealth of amenities including some of Dublin's best schools including Templeogue College, Our Lady's School, Terenure College and St Pius X to name but a few. Recreational and shopping facilities are excellent with Bushy Park, St Mary's RFC, Rathfarnham and Grange Golf Clubs and Templeogue Tennis Club all nearby.",
		"featuredImage" : "./pictures/willingtongreen.jpg",
		"additionalMedia" : [
			"./pictures/willingtongreen2.jpg",
			"./pictures/willingtongreen3.jpg"
		],
		"RoomDetails": "3 Bed , 1 Bath",
		"NumberRating": "B1 Energy Rating",
		"price": "£475,000.00"
	},
	{
		"advertID": 12,
		"advertName": "77 Butterfield Avenue, Rathfarnham, Dublin 14, D14 ET85",
		"advertDescription" : " Set back from the road, No. 77 Butterfield Avenue boasts a 52ft front drive with ample off-street parking. Built in 1968 by Tom Stratton, this family home boasts spacious and versatile living accommodation throughout and offers a discerning purchaser ample scope to reconfigure and extend (subject to P.P.) Having been well maintained through the years, the bright and airy accommodation comprises a large porch, a welcoming entrance hall with understairs storage, the living space is open plan and has a lovely flow throughout with a dining room to the front, a family room / breakfast room which runs the full width of the house. The kitchen is to the front and there is a large sunroom, utility / shower room and guest w.c. all to the back of the house. Upstairs there are four sizeable bedrooms and a family bathroom. The large balcony to the front of the house would lend itself to be built upon to create a larger space upstairs. Location is second to none, being only moments from the many shops and amenities in Rathfarnham and Templeogue villages. Rathfarnham shopping centre, Bushy Park, Rathfarnham Castle and Dodder Valley Park and river are all within a short walk with Marlay Park a short drive away. There is a superb choice of schools within close proximity including Terenure and Templeogue Colleges, Our Lady's School and Loreto Beaufort and well as excellent National Schools (Ballyroan Boys, St Patrick's Girls and St Mary's Boys). The property is very convenient to the M50 motorway and is well served by regular bus services to/from City Centre, Dundrum Town Centre and beyond. The area is both well serviced and mature and built at a time when space was not at a premium.",
		"featuredImage" : "./pictures/butterfieldavenue.jpg",
		"additionalMedia" : [
			"./pictures/butterfieldavenue2.jpg",
			"./pictures/butterfieldavenue3.jpg"
		],
		"RoomDetails": "4 Bed , 1 Bath",
		"NumberRating": "A1 Energy Rating",
		"price": "£655,000.00"
	}
]
